#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_secretsmanager_secret.github_token: Reading...
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_availability_zones.available: Reading...
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240819195525719600000001]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_security_group.gtw_lb: Refreshing state... [id=sg-0ddc9f6d8fb60802e]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_lb_target_group.bff_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/1d41569bc3f6f084]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_lb_target_group.gtw_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/e92af65a6dac2f8c]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_lb.gtw_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/8d58954c43ac110c]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0f505df8b5227d2be]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_lb.bff_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/d8b5fba16e1029bf]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-06e777883e1f5464b]
aws_lb_listener.gtw_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/8d58954c43ac110c/ea74630f48cc0a93]
aws_security_group.redis_sg: Refreshing state... [id=sg-0c9a22295813f5385]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/d8b5fba16e1029bf/3659eafa40c30726]
aws_ecs_task_definition.bff_service_app: Refreshing state... [id=bff-service-app-task]
aws_ecs_task_definition.gtw_service_app: Refreshing state... [id=gtw-service-app-task]
aws_ecs_service.bff_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service]
aws_ecs_service.gtw_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/gtw-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_ecs_cluster.main has been deleted
  - resource "aws_ecs_cluster" "main" {
      - id                 = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster" -> null
        name               = "asics-cluster"
        tags               = {}
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_elasticache_replication_group.redis has been deleted
  - resource "aws_elasticache_replication_group" "redis" {
      - id                             = "my-redis-cluster" -> null
        tags                           = {
            "Name" = "my-redis-cluster"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb.bff_alb has been deleted
  - resource "aws_lb" "bff_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/d8b5fba16e1029bf" -> null
      - dns_name                                    = "internal-bff-alb-1809118463.eu-west-1.elb.amazonaws.com" -> null
        id                                          = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/d8b5fba16e1029bf"
        name                                        = "bff-alb"
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb.gtw_alb has been deleted
  - resource "aws_lb" "gtw_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/8d58954c43ac110c" -> null
        id                                          = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/8d58954c43ac110c"
        name                                        = "gtw-alb"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb_target_group.bff_service_blue_tg has been deleted
  - resource "aws_lb_target_group" "bff_service_blue_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/1d41569bc3f6f084" -> null
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/1d41569bc3f6f084"
        name                               = "bff-service-tg"
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb_target_group.gtw_service_blue_tg has been deleted
  - resource "aws_lb_target_group" "gtw_service_blue_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/e92af65a6dac2f8c" -> null
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/e92af65a6dac2f8c"
        name                               = "gtw-service-tg"
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_elasticache_replication_group.redis_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_elasticache_replication_group" "redis_cluster" {
      + arn                            = (known after apply)
      + auth_token_enabled             = (known after apply)
      + automatic_failover_enabled     = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + description                    = (known after apply)
      + id                             = (known after apply)
      + log_delivery_configuration     = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = (known after apply)
      + node_type                      = (known after apply)
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = (known after apply)
      + number_cache_clusters          = (known after apply)
      + port                           = (known after apply)
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_description  = (known after apply)
      + replication_group_id           = (known after apply)
      + snapshot_retention_limit       = (known after apply)
      + snapshot_window                = (known after apply)
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "asics-cluster"
      + tags_all           = (known after apply)
    }

  # aws_ecs_service.bff_service will be created
  + resource "aws_ecs_service" "bff_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bff-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bff-service"
          + container_port   = 8081
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-06e777883e1f5464b",
            ]
          + subnets          = [
              + "subnet-036a5e724b44fa8df",
              + "subnet-0a15b82f75b3300cd",
            ]
        }
    }

  # aws_ecs_service.gtw_service will be created
  + resource "aws_ecs_service" "gtw_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "gtw-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "gtw-service"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0f505df8b5227d2be",
            ]
          + subnets          = [
              + "subnet-036a5e724b44fa8df",
              + "subnet-0a15b82f75b3300cd",
            ]
        }
    }

  # aws_ecs_task_definition.bff_service_app must be replaced
-/+ resource "aws_ecs_task_definition" "bff_service_app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "CACHE_CONFIG_TTL"
                          - value = "60"
                        },
                      - {
                          - name  = "CLUTCH_BASE_URL"
                          - value = "https://id-sandbox.asics.com"
                        },
                      - {
                          - name  = "CLUTCH_BULKHEAD_MAX_CONCURRENT_CALLS"
                          - value = "100"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                          - value = "50"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_PERMITTED_NUMBER_OF_CALLS_IN_HALF_OPEN_STATE"
                          - value = "5"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_CLOSED_STATE"
                          - value = "100"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_HALF_OPEN_STATE"
                          - value = "10"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_WAIT_DURATION_IN_OPEN_STATE"
                          - value = "30s"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_CAPACITY"
                          - value = "2"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_PERIOD"
                          - value = "60"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_TOKENS"
                          - value = "10"
                        },
                      - {
                          - name  = "CLUTCH_RETRY_MAX_ATTEMPTS"
                          - value = "3"
                        },
                      - {
                          - name  = "CLUTCH_RETRY_WAIT_DURATION"
                          - value = "500ms"
                        },
                      - {
                          - name  = "CLUTCH_TIME_LIMITER_TIMEOUT_DURATION"
                          - value = "2s"
                        },
                      - {
                          - name  = "GRAPHIQL_ENABLED"
                          - value = "false"
                        },
                      - {
                          - name  = "REDIS_NODES"
                          - value = ""
                        },
                      - {
                          - name  = "SPRING_PROFILES_ACTIVE"
                          - value = "dev"
                        },
                    ]
                  - essential        = true
                  - image            = "802288441694.dkr.ecr.eu-west-1.amazonaws.com/asics-bff:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/bff-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "bff-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8081
                          - hostPort      = 8081
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "bff-service-app-task" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.gtw_service_app must be replaced
-/+ resource "aws_ecs_task_definition" "gtw_service_app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "ASICS_AUTH_CLIENT_ID"
                          - value = "one_asics_be_staging"
                        },
                      - {
                          - name  = "ASICS_AUTH_CLIENT_SECRET"
                          - value = "testttttttt"
                        },
                      - {
                          - name  = "ASICS_AUTH_INTROSPECT_ENDPOINT"
                          - value = "https://id-sandbox.asics.com/api/v2/introspect"
                        },
                      - {
                          - name  = "BFF_URL"
                          - value = "http://internal-bff-alb-1809118463.eu-west-1.elb.amazonaws.com"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                          - value = "50"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_PERMITTED_CALLS"
                          - value = "10"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_SLIDING_WINDOW_SIZE"
                          - value = "100"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_WAIT_DURATION"
                          - value = "10000"
                        },
                      - {
                          - name  = "RATE_LIMITER_BURST_CAPACITY"
                          - value = "20"
                        },
                      - {
                          - name  = "RATE_LIMITER_REPLENISH_RATE"
                          - value = "10"
                        },
                      - {
                          - name  = "REDIS_NODES"
                          - value = ""
                        },
                      - {
                          - name  = "REQUEST_SIZE"
                          - value = "2MB"
                        },
                      - {
                          - name  = "RETRY_COUNT"
                          - value = "3"
                        },
                      - {
                          - name  = "SPRING_PROFILES_ACTIVE"
                          - value = "dev"
                        },
                    ]
                  - essential        = true
                  - image            = "802288441694.dkr.ecr.eu-west-1.amazonaws.com/asics-gtw:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/gtw-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "gtw-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "gtw-service-app-task" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_elasticache_replication_group.redis will be created
  + resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = "false"
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Redis replication group with cluster mode enabled"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "tue:06:30-tue:07:30"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t2.micro"
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = 2
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = "default.redis7.cluster.on"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = 1
      + replication_group_description  = (known after apply)
      + replication_group_id           = "my-redis-cluster"
      + security_group_ids             = [
          + "sg-0c9a22295813f5385",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = "01:00-02:00"
      + subnet_group_name              = "redis-subnet-group"
      + tags                           = {
          + "Name" = "my-redis-cluster"
        }
      + tags_all                       = {
          + "Name" = "my-redis-cluster"
        }
      + transit_encryption_enabled     = (known after apply)

      + log_delivery_configuration {
          + destination      = "/cache/redis"
          + destination_type = "cloudwatch-logs"
          + log_format       = "text"
          + log_type         = "slow-log"
        }
    }

  # aws_lb.bff_alb will be created
  + resource "aws_lb" "bff_alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = true
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "bff-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-05b6da332a709d6c8",
        ]
      + subnets                                     = [
          + "subnet-036a5e724b44fa8df",
          + "subnet-0a15b82f75b3300cd",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb.gtw_alb will be created
  + resource "aws_lb" "gtw_alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "gtw-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0ddc9f6d8fb60802e",
        ]
      + subnets                                     = [
          + "subnet-048eedd36dc7ac201",
          + "subnet-0fe80fa5495cb3632",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.dev_listener will be created
  + resource "aws_lb_listener" "dev_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.gtw_listener will be created
  + resource "aws_lb_listener" "gtw_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.bff_service_blue_tg will be created
  + resource "aws_lb_target_group" "bff_service_blue_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "bff-service-tg"
      + port                               = 8081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-034dd95974f394745"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group.gtw_service_blue_tg will be created
  + resource "aws_lb_target_group" "gtw_service_blue_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "gtw-service-tg"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-034dd95974f394745"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-06e777883e1f5464b"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0f505df8b5227d2be"
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 12 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*